# Binning

In [ ]:
import pandas as pd
file = pd.read_csv("binnig data.csv")
file

In [ ]:
bin = [0 , 20 , 35 , 50 , 70]    #yeh hum ny grouping ki ha jis ko dekhty howy hamary groups bany gay 0  - 20  first group , 20 - 35 2nd group m 35 - 50  third group , 50 - 70 4rth group 
group_name = ["Fail" , "Pass" , "Good" , "Excellent"]    #yeh wo names hain jo un group ki values k samny likhian jain gyy
file["Grades"] = pd.cut(file["Marks"] , bin , labels = group_name)   #es main hamny sub sy pehly 1 extra column bnaya jis ka name grade ha us k bad 
file

In [ ]:
group_name

# Pivot

In [9]:
file1 = pd.read_csv("pivot data.csv")
file1

    No   Names  pf marks  linear marks
0    1     Ali        25            25
1    2   Ahmed        54            65
2    3   Bilal        54            41
3    4  Khawar        65            25
4    5     Ali        25            65
5    6   Ahmed        24            38
6    7   Bilal        65            19
7    8  Khawar        78            38
8    9     Ali        54            24
9   10   Ahmed        65            26
10  11   Bilal        85            65
11  12  Khawar        32            25

In [10]:

file1.pivot(index = "No" , columns = "Names")

      pf marks                    linear marks
Names    Ahmed   Ali Bilal Khawar        Ahmed   Ali Bilal Khawar
No
1          NaN  25.0   NaN    NaN          NaN  25.0   NaN    NaN
2         54.0   NaN   NaN    NaN         65.0   NaN   NaN    NaN
3          NaN   NaN  54.0    NaN          NaN   NaN  41.0    NaN
4          NaN   NaN   NaN   65.0          NaN   NaN   NaN   25.0
5          NaN  25.0   NaN    NaN          NaN  65.0   NaN    NaN
6         24.0   NaN   NaN    NaN         38.0   NaN   NaN    NaN
7          NaN   NaN  65.0    NaN          NaN   NaN  19.0    NaN
8          NaN   NaN   NaN   78.0          NaN   NaN   NaN   38.0
9          NaN  54.0   NaN    NaN          NaN  24.0   NaN    NaN
10        65.0   NaN   NaN    NaN         26.0   NaN   NaN    NaN
11         NaN   NaN  85.0    NaN          NaN   NaN  65.0    NaN
12         NaN   NaN   NaN   32.0          NaN   NaN   NaN   25.0

In [12]:
file1.pivot(index = "No" , columns = "Names" , values = "pf marks")

Names  Ahmed   Ali  Bilal  Khawar
No
1        NaN  25.0    NaN     NaN
2       54.0   NaN    NaN     NaN
3        NaN   NaN   54.0     NaN
4        NaN   NaN    NaN    65.0
5        NaN  25.0    NaN     NaN
6       24.0   NaN    NaN     NaN
7        NaN   NaN   65.0     NaN
8        NaN   NaN    NaN    78.0
9        NaN  54.0    NaN     NaN
10      65.0   NaN    NaN     NaN
11       NaN   NaN   85.0     NaN
12       NaN   NaN    NaN    32.0

# pivot table

In [13]:
file1.pivot_table(index = "No" , columns = "Names" )

      linear marks                    pf marks
Names        Ahmed   Ali Bilal Khawar    Ahmed   Ali Bilal Khawar
No
1              NaN  25.0   NaN    NaN      NaN  25.0   NaN    NaN
2             65.0   NaN   NaN    NaN     54.0   NaN   NaN    NaN
3              NaN   NaN  41.0    NaN      NaN   NaN  54.0    NaN
4              NaN   NaN   NaN   25.0      NaN   NaN   NaN   65.0
5              NaN  65.0   NaN    NaN      NaN  25.0   NaN    NaN
6             38.0   NaN   NaN    NaN     24.0   NaN   NaN    NaN
7              NaN   NaN  19.0    NaN      NaN   NaN  65.0    NaN
8              NaN   NaN   NaN   38.0      NaN   NaN   NaN   78.0
9              NaN  24.0   NaN    NaN      NaN  54.0   NaN    NaN
10            26.0   NaN   NaN    NaN     65.0   NaN   NaN    NaN
11             NaN   NaN  65.0    NaN      NaN   NaN  85.0    NaN
12             NaN   NaN   NaN   25.0      NaN   NaN   NaN   32.0

In [23]:
file1.pivot_table(index = "No" , columns = "Names"  , aggfunc = "mean")

      linear marks                    pf marks
Names        Ahmed   Ali Bilal Khawar    Ahmed   Ali Bilal Khawar
No
1              NaN  25.0   NaN    NaN      NaN  25.0   NaN    NaN
2             65.0   NaN   NaN    NaN     54.0   NaN   NaN    NaN
3              NaN   NaN  41.0    NaN      NaN   NaN  54.0    NaN
4              NaN   NaN   NaN   25.0      NaN   NaN   NaN   65.0
5              NaN  65.0   NaN    NaN      NaN  25.0   NaN    NaN
6             38.0   NaN   NaN    NaN     24.0   NaN   NaN    NaN
7              NaN   NaN  19.0    NaN      NaN   NaN  65.0    NaN
8              NaN   NaN   NaN   38.0      NaN   NaN   NaN   78.0
9              NaN  24.0   NaN    NaN      NaN  54.0   NaN    NaN
10            26.0   NaN   NaN    NaN     65.0   NaN   NaN    NaN
11             NaN   NaN  65.0    NaN      NaN   NaN  85.0    NaN
12             NaN   NaN   NaN   25.0      NaN   NaN   NaN   32.0

In [22]:
file1.pivot_table(index = "No" , columns = "Names"  , aggfunc = "sum")

      linear marks                    pf marks
Names        Ahmed   Ali Bilal Khawar    Ahmed   Ali Bilal Khawar
No
1              NaN  25.0   NaN    NaN      NaN  25.0   NaN    NaN
2             65.0   NaN   NaN    NaN     54.0   NaN   NaN    NaN
3              NaN   NaN  41.0    NaN      NaN   NaN  54.0    NaN
4              NaN   NaN   NaN   25.0      NaN   NaN   NaN   65.0
5              NaN  65.0   NaN    NaN      NaN  25.0   NaN    NaN
6             38.0   NaN   NaN    NaN     24.0   NaN   NaN    NaN
7              NaN   NaN  19.0    NaN      NaN   NaN  65.0    NaN
8              NaN   NaN   NaN   38.0      NaN   NaN   NaN   78.0
9              NaN  24.0   NaN    NaN      NaN  54.0   NaN    NaN
10            26.0   NaN   NaN    NaN     65.0   NaN   NaN    NaN
11             NaN   NaN  65.0    NaN      NaN   NaN  85.0    NaN
12             NaN   NaN   NaN   25.0      NaN   NaN   NaN   32.0

In [20]:
file1.pivot_table(index = "No" , columns = "Names"  , aggfunc = "count")

      linear marks                   pf marks
Names        Ahmed  Ali Bilal Khawar    Ahmed  Ali Bilal Khawar
No
1              NaN  1.0   NaN    NaN      NaN  1.0   NaN    NaN
2              1.0  NaN   NaN    NaN      1.0  NaN   NaN    NaN
3              NaN  NaN   1.0    NaN      NaN  NaN   1.0    NaN
4              NaN  NaN   NaN    1.0      NaN  NaN   NaN    1.0
5              NaN  1.0   NaN    NaN      NaN  1.0   NaN    NaN
6              1.0  NaN   NaN    NaN      1.0  NaN   NaN    NaN
7              NaN  NaN   1.0    NaN      NaN  NaN   1.0    NaN
8              NaN  NaN   NaN    1.0      NaN  NaN   NaN    1.0
9              NaN  1.0   NaN    NaN      NaN  1.0   NaN    NaN
10             1.0  NaN   NaN    NaN      1.0  NaN   NaN    NaN
11             NaN  NaN   1.0    NaN      NaN  NaN   1.0    NaN
12             NaN  NaN   NaN    1.0      NaN  NaN   NaN    1.0

In [21]:
file1.pivot_table(index = "No" , columns = "Names" ,  margin = "True")

TypeError: pivot_table() got an unexpected keyword argument 'margin'